tut/5/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.0 0.0000 0.0)
    (0.3 0.0000 0)
    (0.3 0.0049 0)
    (0.0 0.0049 0)
    (0.0 0.0000 0.005)
    (0.3 0.0000 0.005)
    (0.3 0.0049 0.005)
    (0.0 0.0049 0.005)

    (0.0 0.0101 0)
    (0.3 0.0101 0)
    (0.3 0.0101 0.005)
    (0.0 0.0101 0.005)

    (-0.005 0.0049 0)
    (-0.005 0.0049 0.005)
    (-0.005 0.0101 0)
    (-0.005 0.0101 0.005)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1000 40 1) simpleGrading (
(
    (0.25 0.6 1.0)
    (0.75 0.4 10.0)
)
(1.0) (1.0))
    hex (3 2 9 8 7 6 10 11) (1000 40 1) simpleGrading (
(
    (0.25 0.6 1.0)
    (0.75 0.4 10.0)
)
(1.0) (1.0))
    hex (12 3 8 14 13 7 11 15) (40 40 1) simpleGrading (1.0 1.0 1.0)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (12 13 14 15)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
            (2 6 10 9)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (14 8 11 15)
            (8 9 10 11)
            (12 3 7 13)
            (0 4 7 3)
            (0 4 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (12 3 8 14)
            (3 2 9 8)
            (0 1 2 3)
            (13 7 11 15)
            (7 6 10 11)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
